# SF Salaries Pandas Exercise

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('Salaries.csv')
df

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

            Id       EmployeeName  ...         Agency Status
0            1     NATHANIEL FORD  ...  San Francisco    NaN
1            2       GARY JIMENEZ  ...  San Francisco    NaN
2            3     ALBERT PARDINI  ...  San Francisco    NaN
3            4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4            5    PATRICK GARDNER  ...  San Francisco    NaN
...        ...                ...  ...            ...    ...
148649  148650      Roy I Tillery  ...  San Francisco     PT
148650  148651       Not provided  ...  San Francisco    NaN
148651  148652       Not provided  ...  San Francisco    NaN
148652  148653       Not provided  ...  San Francisco    NaN
148653  148654          Joe Lopez  ...  San Francisco     PT

[148654 rows x 13 columns]

In [4]:
df.head()

   Id       EmployeeName  ...         Agency Status
0   1     NATHANIEL FORD  ...  San Francisco    NaN
1   2       GARY JIMENEZ  ...  San Francisco    NaN
2   3     ALBERT PARDINI  ...  San Francisco    NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5    PATRICK GARDNER  ...  San Francisco    NaN

[5 rows x 13 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [14]:
df['TotalPay'].mean()

74768.321971703

In [17]:
df['BasePay'] = pd.to_numeric(df['BasePay'],errors = 'coerce')
df['BasePay'].mean()

66325.44884050643

In [18]:
df['OvertimePay'] = pd.to_numeric(df['OvertimePay'],errors = 'coerce')
df['OvertimePay'].mean()

5066.059886444622

In [19]:
df['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [20]:
df['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [27]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']

    Id     EmployeeName                   JobTitle  ...  Notes         Agency Status
24  25  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION  ...    NaN  San Francisco    NaN

[1 rows x 13 columns]

In [29]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL'] ['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [30]:
df['TotalPayBenefits']

0         567595.43
1         538909.28
2         335279.91
3         332343.61
4         326373.19
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653      -618.13
Name: TotalPayBenefits, Length: 148654, dtype: float64

In [31]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL'] ['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [32]:
df['TotalPayBenefits'].max()

567595.43

In [40]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()] ['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [42]:
df['TotalPayBenefits'].idxmax()
df['TotalPayBenefits'].argmax()

0

In [43]:
df.iloc[df['TotalPayBenefits'].argmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                     167411
OvertimePay                                                      0
OtherPay                                                    400184
Benefits                                                       NaN
TotalPay                                                    567595
TotalPayBenefits                                            567595
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [44]:
df['TotalPayBenefits'].argmin()

148653

In [45]:
df.iloc[df['TotalPayBenefits'].argmin()]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                      0
OvertimePay                                  0
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

In [46]:
df.groupby('Year').mean()

            Id       BasePay  ...  TotalPayBenefits  Notes
Year                          ...
2011   18080.0  63595.956517  ...      71744.103871    NaN
2012   54542.5  65436.406857  ...     100553.229232    NaN
2013   91728.5  69630.030216  ...     101440.519714    NaN
2014  129593.0  66564.421924  ...     100250.918884    NaN

[4 rows x 6 columns]

In [47]:
df.groupby('Year').mean() ['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [48]:
df['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [50]:
df['JobTitle'].nunique()

2159

In [52]:
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [53]:
df[df['Year'] == 2013] ['JobTitle'].value_counts()

Transit Operator                  2295
Special Nurse                     1445
Registered Nurse                  1231
Public Svc Aide-Public Works       859
Custodian                          789
                                  ...
Port Director                        1
Specialist in Aging 2                1
Senior Museum Preparator             1
Civil Case Settlmnt Specialist       1
Chf District Atty Investigator       1
Name: JobTitle, Length: 1051, dtype: int64

In [54]:
sum(df[df['Year'] == 2013] ['JobTitle'].value_counts() == 1)

202

In [60]:
df[df['JobTitle'] == 'Chef']
# df['JobTitle'].nunique()

            Id          EmployeeName JobTitle  ...  Notes         Agency Status
52862    52863    Rodney Lee Garrick     Chef  ...    NaN  San Francisco    NaN
53262    53263         Diego Davalos     Chef  ...    NaN  San Francisco    NaN
53612    53613       Joseph Hoeschen     Chef  ...    NaN  San Francisco    NaN
54656    54657    Leonard Collins-Jr     Chef  ...    NaN  San Francisco    NaN
90000    90001   Rodney Lee  Garrick     Chef  ...    NaN  San Francisco    NaN
90992    90993        Diego  Davalos     Chef  ...    NaN  San Francisco    NaN
91783    91784  Leonard L Collins-Jr     Chef  ...    NaN  San Francisco    NaN
96612    96613     Joseph E Hoeschen     Chef  ...    NaN  San Francisco    NaN
102346  102347        Gregg S Bosnak     Chef  ...    NaN  San Francisco    NaN
104213  104214           Julie  Neil     Chef  ...    NaN  San Francisco    NaN
123452  123453         Diego Davalos     Chef  ...    NaN  San Francisco     FT
127203  127204    Rodney Lee Garrick     Chef  ...    NaN  San Francisco     FT
128014  128015     Joseph E Hoeschen     Chef  ...    NaN  San Francisco     FT
128096  128097  Leonard L Collins-Jr     Chef  ...    NaN  San Francisco     FT
142524  142525   Nathaniel C Collins     Chef  ...    NaN  San Francisco     PT
143644  143645       John P Scholten     Chef  ...    NaN  San Francisco     PT

[16 rows x 13 columns]

In [64]:
def chiefCheck(arg):
  if 'chief' in arg.lower().split():
    return True
  else: 
    return False

In [66]:
df['JobTitle'].apply(lambda x: chiefCheck(x)).nunique()

2

In [67]:
sum(df['JobTitle'].apply(lambda x: chiefCheck(x)))

477

In [69]:
df['title_len'] = df['JobTitle'].apply(len)

In [71]:
df[['title_len','TotalPayBenefits']].corr() # No correlation

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000